/**
* @file FuncTester.h
* Файл оголошення класу-тестера
* @author Momot Roman
* @version 1.0
* @date 2020.05.26
*/

#pragma once
#include "programList.h"	/** Підключення файлу programList.h */
class FuncTester			/** Оголошення класу-тестера */
{
private:
	CList value;			/** Змінна класу-контролера */

public:
	void Sort_Test();		/** Оголошення метода тестування сортування */
	void Add_Test();		/** Оголошення метода тестування додавання елементів */
	void Delete_Test();		/** Оголошення метода тестування видалення елементів */
	void Task_Test();		/** Оголошення метода тестування виконання індивідуального завдання */
	void ReadFile_Test();	/** Оголошення метода тестування читання з файлу */
	void SaveFile_Test();	/** Оголошення метода тестування запису даних у файл */

	FuncTester();			/** Оголошення конструктора за замовчуванням */
	~FuncTester();			/** Оголошення деструктора */
};

